# CannotCreateRevealIntegralError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures..::..CannotCreateRevealIntegralError Property
BuiltInFailures..::..CreationFailures Class See Also
---
Could not create integral reveal for wall instance. [Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateRevealIntegralError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateRevealIntegralError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateRevealIntegralError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CreationFailures Class
Autodesk.Revit.DB Namespace